Enums/упТипыОперацийВводаНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыОперацийВводаНачальныхОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОстаткиАгрегатовНаСкладах</Name>
					<Comment>Ввод начальных остатков агрегатов на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиМатериаловНаСкладах</Name>
					<Comment>Ввод начальных остатков материалов на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиОборудованияНаСкладах</Name>
					<Comment>Ввод начальных остатков по дополнительному оборудованию на складах</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыОперацийВводаНачальныхОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ИспользуетсяУчетШинУзловИАгрегатов          = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов");
	Если ИспользуетсяУчетШинУзловИАгрегатов Тогда
		ДанныеВыбора.Добавить(Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах);	
	КонецЕсли;
	
	ИспользуетсяУчетМатериалов                  = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетМатериалов");
	Если ИспользуетсяУчетМатериалов Тогда
		ДанныеВыбора.Добавить(Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиМатериаловНаСкладах);	
	КонецЕсли;
	
	ИспользуетсяУчетДополнительногоОборудования = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования");
	Если ИспользуетсяУчетДополнительногоОборудования Тогда
		ДанныеВыбора.Добавить(Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах);	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
